MikroElektronika/core_packages/PIC/XC8/def/PIC18F27J13/mcu.h
// Register: ANCON0
#define ANCON0 ANCON0
extern volatile unsigned char           ANCON0              __at(0xF48);
#ifndef _LIB_BUILD
asm("ANCON0 equ 0F48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCFG0                  :1;
        unsigned PCFG1                  :1;
        unsigned PCFG2                  :1;
        unsigned PCFG3                  :1;
        unsigned PCFG4                  :1;
    };
} ANCON0bits_t;
extern volatile ANCON0bits_t ANCON0bits __at(0xF48);
// bitfield macros
#define _ANCON0_PCFG0_POSN                                  0x0
#define _ANCON0_PCFG0_POSITION                              0x0
#define _ANCON0_PCFG0_SIZE                                  0x1
#define _ANCON0_PCFG0_LENGTH                                0x1
#define _ANCON0_PCFG0_MASK                                  0x1
#define _ANCON0_PCFG1_POSN                                  0x1
#define _ANCON0_PCFG1_POSITION                              0x1
#define _ANCON0_PCFG1_SIZE                                  0x1
#define _ANCON0_PCFG1_LENGTH                                0x1
#define _ANCON0_PCFG1_MASK                                  0x2
#define _ANCON0_PCFG2_POSN                                  0x2
#define _ANCON0_PCFG2_POSITION                              0x2
#define _ANCON0_PCFG2_SIZE                                  0x1
#define _ANCON0_PCFG2_LENGTH                                0x1
#define _ANCON0_PCFG2_MASK                                  0x4
#define _ANCON0_PCFG3_POSN                                  0x3
#define _ANCON0_PCFG3_POSITION                              0x3
#define _ANCON0_PCFG3_SIZE                                  0x1
#define _ANCON0_PCFG3_LENGTH                                0x1
#define _ANCON0_PCFG3_MASK                                  0x8
#define _ANCON0_PCFG4_POSN                                  0x4
#define _ANCON0_PCFG4_POSITION                              0x4
#define _ANCON0_PCFG4_SIZE                                  0x1
#define _ANCON0_PCFG4_LENGTH                                0x1
#define _ANCON0_PCFG4_MASK                                  0x10

// Register: ANCON1
#define ANCON1 ANCON1
extern volatile unsigned char           ANCON1              __at(0xF49);
#ifndef _LIB_BUILD
asm("ANCON1 equ 0F49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCFG8                  :1;
        unsigned PCFG9                  :1;
        unsigned PCFG10                 :1;
        unsigned PCFG11                 :1;
        unsigned PCFG12                 :1;
        unsigned                        :2;
        unsigned VBGEN                  :1;
    };
    struct {
        unsigned                        :7;
        unsigned PCFG15                 :1;
    };
} ANCON1bits_t;
extern volatile ANCON1bits_t ANCON1bits __at(0xF49);
// bitfield macros
#define _ANCON1_PCFG8_POSN                                  0x0
#define _ANCON1_PCFG8_POSITION                              0x0
#define _ANCON1_PCFG8_SIZE                                  0x1
#define _ANCON1_PCFG8_LENGTH                                0x1
#define _ANCON1_PCFG8_MASK                                  0x1
#define _ANCON1_PCFG9_POSN                                  0x1
#define _ANCON1_PCFG9_POSITION                              0x1
#define _ANCON1_PCFG9_SIZE                                  0x1
#define _ANCON1_PCFG9_LENGTH                                0x1
#define _ANCON1_PCFG9_MASK                                  0x2
#define _ANCON1_PCFG10_POSN                                 0x2
#define _ANCON1_PCFG10_POSITION                             0x2
#define _ANCON1_PCFG10_SIZE                                 0x1
#define _ANCON1_PCFG10_LENGTH                               0x1
#define _ANCON1_PCFG10_MASK                                 0x4
#define _ANCON1_PCFG11_POSN                                 0x3
#define _ANCON1_PCFG11_POSITION                             0x3
#define _ANCON1_PCFG11_SIZE                                 0x1
#define _ANCON1_PCFG11_LENGTH                               0x1
#define _ANCON1_PCFG11_MASK                                 0x8
#define _ANCON1_PCFG12_POSN                                 0x4
#define _ANCON1_PCFG12_POSITION                             0x4
#define _ANCON1_PCFG12_SIZE                                 0x1
#define _ANCON1_PCFG12_LENGTH                               0x1
#define _ANCON1_PCFG12_MASK                                 0x10
#define _ANCON1_VBGEN_POSN                                  0x7
#define _ANCON1_VBGEN_POSITION                              0x7
#define _ANCON1_VBGEN_SIZE                                  0x1
#define _ANCON1_VBGEN_LENGTH                                0x1
#define _ANCON1_VBGEN_MASK                                  0x80
#define _ANCON1_PCFG15_POSN                                 0x7
#define _ANCON1_PCFG15_POSITION                             0x7
#define _ANCON1_PCFG15_SIZE                                 0x1
#define _ANCON1_PCFG15_LENGTH                               0x1
#define _ANCON1_PCFG15_MASK                                 0x80

// Register: DSWAKEL
#define DSWAKEL DSWAKEL
extern volatile unsigned char           DSWAKEL             __at(0xF4A);
#ifndef _LIB_BUILD
asm("DSWAKEL equ 0F4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSPOR                  :1;
        unsigned                        :1;
        unsigned DSMCLR                 :1;
        unsigned DSRTC                  :1;
        unsigned DSWDT                  :1;
        unsigned DSULP                  :1;
        unsigned                        :1;
        unsigned DSFLT                  :1;
    };
} DSWAKELbits_t;
extern volatile DSWAKELbits_t DSWAKELbits __at(0xF4A);
// bitfield macros
#define _DSWAKEL_DSPOR_POSN                                 0x0
#define _DSWAKEL_DSPOR_POSITION                             0x0
#define _DSWAKEL_DSPOR_SIZE                                 0x1
#define _DSWAKEL_DSPOR_LENGTH                               0x1
#define _DSWAKEL_DSPOR_MASK                                 0x1
#define _DSWAKEL_DSMCLR_POSN                                0x2
#define _DSWAKEL_DSMCLR_POSITION                            0x2
#define _DSWAKEL_DSMCLR_SIZE                                0x1
#define _DSWAKEL_DSMCLR_LENGTH                              0x1
#define _DSWAKEL_DSMCLR_MASK                                0x4
#define _DSWAKEL_DSRTC_POSN                                 0x3
#define _DSWAKEL_DSRTC_POSITION                             0x3
#define _DSWAKEL_DSRTC_SIZE                                 0x1
#define _DSWAKEL_DSRTC_LENGTH                               0x1
#define _DSWAKEL_DSRTC_MASK                                 0x8
#define _DSWAKEL_DSWDT_POSN                                 0x4
#define _DSWAKEL_DSWDT_POSITION                             0x4
#define _DSWAKEL_DSWDT_SIZE                                 0x1
#define _DSWAKEL_DSWDT_LENGTH                               0x1
#define _DSWAKEL_DSWDT_MASK                                 0x10
#define _DSWAKEL_DSULP_POSN                                 0x5
#define _DSWAKEL_DSULP_POSITION                             0x5
#define _DSWAKEL_DSULP_SIZE                                 0x1
#define _DSWAKEL_DSULP_LENGTH                               0x1
#define _DSWAKEL_DSULP_MASK                                 0x20
#define _DSWAKEL_DSFLT_POSN                                 0x7
#define _DSWAKEL_DSFLT_POSITION                             0x7
#define _DSWAKEL_DSFLT_SIZE                                 0x1
#define _DSWAKEL_DSFLT_LENGTH                               0x1
#define _DSWAKEL_DSFLT_MASK                                 0x80

// Register: DSWAKEH
#define DSWAKEH DSWAKEH
extern volatile unsigned char           DSWAKEH             __at(0xF4B);
#ifndef _LIB_BUILD
asm("DSWAKEH equ 0F4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSINT0                 :1;
    };
} DSWAKEHbits_t;
